In [1]:
import pandas as pd
import numpy as np

In [4]:
import pandas as pd
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [13]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [14]:
df.tail(2)

    X   Y   Z
3  80  83  72
4  86  86  83

In [7]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [8]:
df.iloc[3:5,2]

3    72
4    83
Name: Z, dtype: int64

In [10]:
df.describe()

          X          Y          Z
count   5.0   5.000000   5.000000
mean   85.0  87.200000  86.800000
std     7.0   4.438468  10.281051
min    78.0  83.000000  72.000000
25%    80.0  84.000000  83.000000
50%    85.0  86.000000  86.000000
75%    86.0  89.000000  96.000000
max    96.0  94.000000  97.000000

In [15]:
df.shape

(5, 3)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       5 non-null      int64
 1   Y       5 non-null      int64
 2   Z       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [17]:
df.describe()

          X          Y          Z
count   5.0   5.000000   5.000000
mean   85.0  87.200000  86.800000
std     7.0   4.438468  10.281051
min    78.0  83.000000  72.000000
25%    80.0  84.000000  83.000000
50%    85.0  86.000000  86.000000
75%    86.0  89.000000  96.000000
max    96.0  94.000000  97.000000

In [18]:
df[['Y','Z']]

    Y   Z
0  84  86
1  94  97
2  89  96
3  83  72
4  86  83

In [19]:
df.iloc[3:5, 2]

3    72
4    83
Name: Z, dtype: int64

In [20]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [22]:
df.columns = ['apple', 'banana', 'orange']

In [23]:
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [24]:
df['banana'].mean()

87.2

In [25]:
df['banana'].min()

83

In [26]:
df['banana'].max()

94

In [27]:
df['banana'].std()

4.43846820423443

In [28]:
df['banana'].count()

5

In [30]:
df['banana'].sort_values(ascending=False)

1    94
2    89
4    86
0    84
3    83
Name: banana, dtype: int64

In [31]:
df.sort_values(by='apple',ascending=False)

   apple  banana  orange
2     96      89      96
4     86      86      83
1     85      94      97
3     80      83      72
0     78      84      86

In [32]:
df[df.apple >= 80]

   apple  banana  orange
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [33]:
df[df.orange == 72]

   apple  banana  orange
3     80      83      72

In [35]:
df[(df.orange >= 72) & (df.apple >= 90)]

   apple  banana  orange
2     96      89      96

In [36]:
df[(df.orange >= 72) | (df.apple >= 90)]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [37]:
df['banana'].replace(84,50)

0    50
1    94
2    89
3    83
4    86
Name: banana, dtype: int64

In [38]:
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [40]:
df['banana'] = df['banana'].replace(84,50)

In [41]:
df

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [42]:
df.head()

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83